RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_crc.c
/**
 *******************************************************************************
 * @file  hc32_ll_crc.c
 * @brief This file provides firmware functions to manage the Cyclic Redundancy
 *        Check(CRC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_crc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_CRC CRC
 * @brief Cyclic Redundancy Check Driver Library
 * @{
 */

#if (LL_CRC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CRC_Local_Macros CRC Local Macros
 * @{
 */

/**
 * @defgroup CRC_Check_Parameters_Validity CRC Check Parameters Validity
 * @{
 */
/*! Parameter validity check for CRC protocol. */
#define IS_CRC_PROTOCOL(x)                                                     \
(   ((x) == CRC_CRC16)                  ||                                     \
    ((x) == CRC_CRC32))

/*! Parameter validity check for CRC data width. */
#define IS_CRC_DATA_WIDTH(x)                                                   \
(   ((x) == CRC_DATA_WIDTH_8BIT)        ||                                     \
    ((x) == CRC_DATA_WIDTH_16BIT)       ||                                     \
    ((x) == CRC_DATA_WIDTH_32BIT))

/*! Parameter validity check for REFIN. */
#define IS_CRC_REFIN(x)                                                        \
(   ((x) == CRC_REFIN_ENABLE)           ||                                     \
    ((x) == CRC_REFIN_DISABLE))

/*! Parameter validity check for REFOUT. */
#define IS_CRC_REFOUT(x)                                                       \
(   ((x) == CRC_REFOUT_ENABLE)          ||                                     \
    ((x) == CRC_REFOUT_DISABLE))

/*! Parameter validity check for XOROUT. */
#define IS_CRC_XOROUT(x)                                                       \
(   ((x) == CRC_XOROUT_ENABLE)          ||                                     \
    ((x) == CRC_XOROUT_DISABLE))
/**
 * @}
 */

/**
 * @defgroup CRC_Registers_Reset_Value_definition CRC Registers Reset Value
 * @{
 */
#define CRC_CR_RST_VALUE                (0x001CUL)
/**
 * @}
 */

/**
 * @defgroup CRC_DATA_Bit_Width CRC Data Bit Width
 * @{
 */
#define CRC_DATA_WIDTH_8BIT             (1U)
#define CRC_DATA_WIDTH_16BIT            (2U)
#define CRC_DATA_WIDTH_32BIT            (4U)
/**
 * @}
 */

/**
 * @defgroup CRC_Register_Address CRC Register Address
 * @{
 */
#define CRC_DATA_ADDR                   ((uint32_t)(&CM_CRC->DAT0))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CRC_Local_Functions CRC Local Functions
 * @{
 */

/**
 * @brief  Convert CRC value.
 * @param  [in]  u32CrcValue        The CRC value of CRC16 or CRC32.
 * @retval the converted CRC value
 */
static uint32_t CRC_ConvertCrcValue(uint32_t u32CrcValue)
{
    uint8_t i;
    uint8_t u8Size;
    uint8_t u8Offset;
    uint32_t u32Temp;
    uint32_t u32Config;
    uint32_t u32FinalCrcValue = u32CrcValue;
    const uint32_t u32ConvertFlag = (CRC_REFIN_ENABLE | CRC_REFOUT_ENABLE | CRC_XOROUT_ENABLE);

    u32Config = READ_REG32(CM_CRC->CR);

    if ((u32Config & u32ConvertFlag) != u32ConvertFlag) {
        if ((u32Config & CRC_CR_CR) == CRC_CRC32) {
            u8Size = 32U;
        } else {
            u8Size = 16U;
        }

        if ((u32Config & CRC_CR_REFOUT) == CRC_REFOUT_DISABLE) {
            u32FinalCrcValue = __RBIT(u32FinalCrcValue); /* Bits reversing. */
            if (u8Size == 16U) {
                u32FinalCrcValue >>= 16U;
                u32FinalCrcValue &= 0xFFFFUL;
            }
        }

        if ((u32Config & CRC_CR_XOROUT) == CRC_XOROUT_DISABLE) {
            u32FinalCrcValue = ~u32FinalCrcValue;   /* Bits NOT. */
        }

        if ((u32Config & CRC_CR_REFIN) == CRC_REFIN_DISABLE) {
            u8Size /= 8U;
            /* Bits reversing in bytes. */
            for (i = 0U; i < u8Size; i++) {
                u8Offset = i * 8U;
                u32Temp  = (u32FinalCrcValue >> u8Offset) & 0xFFUL;
                u32Temp  = __RBIT(u32Temp); /* Bits reversing. */
                u32Temp  = u32Temp >> (24U - u8Offset);
                u32FinalCrcValue &= ~((uint32_t)0xFFUL << u8Offset);
                u32FinalCrcValue |= u32Temp;
            }
        }
    }

