RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_crc.c
    if ((pvData != NULL) && (u32Len != 0UL)) {
        (void)CRC_Calculate(u32InitValue, u8DataWidth, pvData, u32Len);

        u32ExpectValue = CRC_ConvertCrcValue(u32ExpectValue);

        if (READ_REG32_BIT(CM_CRC->CR, CRC_CR_CR) == CRC_CRC32) {
            (void)CRC_WriteData32(&u32ExpectValue, 1UL);
        } else {
            (void)CRC_WriteData16((uint16_t *)((void *)&u32ExpectValue), 1UL);
        }

        enStatus = CRC_GetResultStatus();
    }

    return enStatus;
}
/**
 * @}
 */

/**
 * @defgroup CRC_Global_Functions CRC Global Functions
 * @{
 */

/**
 * @brief  Set the fields of structure stc_crc_init_t to default values.
 * @param  [out] pstcCrcInit            Pointer to a @ref stc_crc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcCrcInit value is NULL.
 */
int32_t CRC_StructInit(stc_crc_init_t *pstcCrcInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcCrcInit) {
        pstcCrcInit->u32Protocol = CRC_CRC16;
        pstcCrcInit->u32InitValue = CRC16_INIT_VALUE;
        pstcCrcInit->u32RefIn = CRC_REFIN_ENABLE;
        pstcCrcInit->u32RefOut = CRC_REFOUT_ENABLE;
        pstcCrcInit->u32XorOut = CRC_XOROUT_ENABLE;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Initialize the CRC.
 * @param  [in] pstcCrcInit             Pointer to a @ref stc_crc_init_t structure.
 * @retval int32_t:
 *           - LL_OK:                   Initialize successfully.
 *           - LL_ERR_INVD_PARAM:       The pointer pstcCrcInit value is NULL.
 */
int32_t CRC_Init(const stc_crc_init_t *pstcCrcInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcCrcInit) {
        DDL_ASSERT(IS_CRC_PROTOCOL(pstcCrcInit->u32Protocol));
        CRC_DeInit();

        DDL_ASSERT(IS_CRC_REFIN(pstcCrcInit->u32RefIn));
        DDL_ASSERT(IS_CRC_REFOUT(pstcCrcInit->u32RefOut));
        DDL_ASSERT(IS_CRC_XOROUT(pstcCrcInit->u32XorOut));

        WRITE_REG32(CM_CRC->CR, (pstcCrcInit->u32RefIn | pstcCrcInit->u32RefOut | pstcCrcInit->u32XorOut));

        MODIFY_REG32(CM_CRC->CR, CRC_CRC32, pstcCrcInit->u32Protocol);

        /* Set initial value */
        if (CRC_CRC32 == pstcCrcInit->u32Protocol) {
            WRITE_REG32(CM_CRC->RESLT, pstcCrcInit->u32InitValue);
        } else {
            WRITE_REG16(CM_CRC->RESLT, pstcCrcInit->u32InitValue);
        }

        i32Ret = LL_OK;
    }
    return i32Ret;
}

/**
 * @brief  De-initialize the CRC.
 * @param  None
 * @retval None
 */
void CRC_DeInit(void)
{
    WRITE_REG32(CM_CRC->CR, CRC_CR_RST_VALUE);
}

/**
 * @brief  Get status of the CRC operation result.
 * @param  None
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t CRC_GetResultStatus(void)
{
    uint32_t u32Status;

    if (READ_REG32_BIT(CM_CRC->CR, CRC_CR_CR) == CRC_CRC32) {
        u32Status = READ_REG32_BIT(CM_CRC->FLG, CRC_FLG_CRCFLAG_32);
    } else {
        u32Status = READ_REG32_BIT(CM_CRC->RESLT, CRC_RESLT_CRCFLAG_16);
    }

    return (u32Status > 0UL) ? SET : RESET;
}

/**
 * @brief  Calculate the CRC value and start with the previously calculated CRC as initial value.
 * @param  [in] au8Data                 Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in bytes) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_AccumulateData8(const uint8_t au8Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au8Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Accumulate(CRC_DATA_WIDTH_8BIT, au8Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Calculate the CRC value and start with the previously calculated CRC as initial value.
 * @param  [in] au16Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in half-word) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_AccumulateData16(const uint16_t au16Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au16Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Accumulate(CRC_DATA_WIDTH_16BIT, au16Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Calculate the CRC value and start with the previously calculated CRC as initial value.
 * @param  [in] au32Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in word) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_AccumulateData32(const uint32_t au32Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au32Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Accumulate(CRC_DATA_WIDTH_32BIT, au32Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Calculate the CRC value and start with the specified initial value(u32InitValue).
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au8Data                 Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in byte) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_CalculateData8(uint32_t u32InitValue, const uint8_t au8Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au8Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Calculate(u32InitValue, CRC_DATA_WIDTH_8BIT, au8Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Calculate the CRC value and start with the specified initial value(u32InitValue).
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au16Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in half-word) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_CalculateData16(uint32_t u32InitValue, const uint16_t au16Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au16Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Calculate(u32InitValue, CRC_DATA_WIDTH_16BIT, au16Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Calculate the CRC value and start with the specified initial value(u32InitValue).
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au32Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in word) of the data to be calculated.
 * @retval The CRC value.
 * @note   The upper 16 bit of CRC result value is ignored when using CRC16
 */
uint32_t CRC_CalculateData32(uint32_t u32InitValue, const uint32_t au32Data[], uint32_t u32Len)
{
    uint32_t u32CrcValue = 0UL;

    if ((au32Data != NULL) && (u32Len != 0UL)) {
        u32CrcValue = CRC_Calculate(u32InitValue, CRC_DATA_WIDTH_32BIT, au32Data, u32Len);
    }

    return u32CrcValue;
}

/**
 * @brief  Check the CRC calculating result with the expected value.
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au8Data                 Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in byte) of the data to be calculated.
 * @param  [in] u32ExpectValue          The expected CRC value to be checked.
 * @retval An @ref en_flag_status_t enumeration type value.
 * @note   The upper 16 bit of CRC result value and the expected value are ignored when using CRC16
 */
en_flag_status_t CRC_CheckData8(uint32_t u32InitValue, const uint8_t au8Data[],
                                uint32_t u32Len, uint32_t u32ExpectValue)
{
    en_flag_status_t enStatus = RESET;

    if ((au8Data != NULL) && (u32Len != 0UL)) {
        enStatus = CRC_CheckData(u32InitValue, CRC_DATA_WIDTH_8BIT, au8Data, u32Len, u32ExpectValue);
    }

