RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_crc.c
    return enStatus;
}

/**
 * @brief  Check the CRC calculating result with the expected value.
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au16Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in half-word) of the data to be calculated.
 * @param  [in] u32ExpectValue          The expected CRC value to be checked.
 * @retval An @ref en_flag_status_t enumeration type value.
 * @note   The upper 16 bit of CRC result value and the expected value are ignored when using CRC16
 */
en_flag_status_t CRC_CheckData16(uint32_t u32InitValue, const uint16_t au16Data[],
                                 uint32_t u32Len, uint32_t u32ExpectValue)
{
    en_flag_status_t enStatus = RESET;

    if ((au16Data != NULL) && (u32Len != 0UL)) {
        enStatus = CRC_CheckData(u32InitValue, CRC_DATA_WIDTH_16BIT, au16Data, u32Len, u32ExpectValue);
    }

    return enStatus;
}

/**
 * @brief  Check the CRC calculating result with the expected value.
 * @param  [in] u32InitValue            The CRC initialization value which is the valid bits same as
 *                                      the bits of CRC Protocol.
 * @param  [in] au32Data                Pointer to the buffer containing the data to be calculated.
 * @param  [in] u32Len                  The length(counted in word) of the data to be calculated.
 * @param  [in] u32ExpectValue          The expected CRC value to be checked.
 * @retval An @ref en_flag_status_t enumeration type value.
 * @note   The upper 16 bit of CRC result value and the expected value are ignored when using CRC16
 */
en_flag_status_t CRC_CheckData32(uint32_t u32InitValue, const uint32_t au32Data[],
                                 uint32_t u32Len, uint32_t u32ExpectValue)
{
    en_flag_status_t enStatus = RESET;

    if ((au32Data != NULL) && (u32Len != 0UL)) {
        enStatus = CRC_CheckData(u32InitValue, CRC_DATA_WIDTH_32BIT, au32Data, u32Len, u32ExpectValue);
    }

    return enStatus;
}

/**
 * @}
 */

#endif /* LL_CRC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
